OpenNuvoton/M55M1BSP/SampleCode/ISP/common/ISP_startup_M55M1.c
    UART5_IRQHandler,                         /*!<  80 UART5 Interrupt Handler                          */
    UART6_IRQHandler,                         /*!<  81 UART6 Interrupt Handler                          */
    UART7_IRQHandler,                         /*!<  82 UART7 Interrupt Handler                          */
    UART8_IRQHandler,                         /*!<  83 UART8 Interrupt Handler                          */
    UART9_IRQHandler,                         /*!<  84 UART9 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    EINT6_IRQHandler,                         /*!<  88 External Input 6 Interrupt Handler               */
    EINT7_IRQHandler,                         /*!<  89 External Input 7 Interrupt Handler               */

    LPUART0_IRQHandler,                       /*!<  90 Low Power UART 0 Interrupt Handler               */
    0,                                        /*!<     Reserved                                         */
    I2C0_IRQHandler,                          /*!<  92 I2C0 Interrupt Handler                           */
    I2C1_IRQHandler,                          /*!<  93 I2C1 Interrupt Handler                           */
    I2C2_IRQHandler,                          /*!<  94 I2C2 Interrupt Handler                           */
    I2C3_IRQHandler,                          /*!<  95 I2C3 Interrupt Handler                           */
    LPI2C0_IRQHandler,                        /*!<  96 Low Power I2C 0 Interrupt Handler                */
    USCI0_IRQHandler,                         /*!<  97 USCI0 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    SC0_IRQHandler,                           /*!<  99 Smart Card Host 0 Interrupt Handler              */

    SC1_IRQHandler,                           /*!< 100 Smart Card Host 1 Interrupt Handler              */
    SC2_IRQHandler,                           /*!< 101 Smart Card Host 2 Interrupt Handler              */
    PSIO_IRQHandler,                          /*!< 102 PSIO Interrupt Handler                           */
    DMIC0_IRQHandler,                         /*!< 103 DMIC0 Interrupt Handler                          */
    DMIC0VAD_IRQHandler,                      /*!< 104 DMIC0 VAD Interrupt Handler                      */
    I2S0_IRQHandler,                          /*!< 105 I2S0 Interrupt Handler                           */
    I2S1_IRQHandler,                          /*!< 106 I2S1 Interrupt Handler                           */
    TRNG_IRQHandler,                          /*!< 107 TRNG Interrupt Handler                           */
    I3C0_IRQHandler,                          /*!< 108 I3C0 Interrupt Handler                           */
    0,                                        /*!<     Reserved                                         */

    OTFC0_IRQHandler,                         /*!< 110 OTFC0 Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    KPI_IRQHandler,                           /*!< 112 KPI Interrupt Handler                            */
    SDH0_IRQHandler,                          /*!< 113 SD Host 0 Interrupt Handler                      */
    SDH1_IRQHandler,                          /*!< 114 SD Host 1 Interrupt Handler                      */
    CCAP_IRQHandler,                          /*!< 115 CCAP Interrupt Handler                           */
    CRYPTO_IRQHandler,                        /*!< 116 CRYPTO Interrupt Handler                         */
    CANFD00_IRQHandler,                       /*!< 117 CANFD0 Interrupt 0 Handler                       */
    CANFD01_IRQHandler,                       /*!< 118 CANFD0 Interrupt 1 Handler                       */
    CANFD10_IRQHandler,                       /*!< 119 CANFD1 Interrupt 0 Handler                       */

    CANFD11_IRQHandler,                       /*!< 120 CANFD1 Interrupt 1 Handler                       */
};

#if defined ( __GNUC__ )
    #pragma GCC diagnostic pop
#endif


/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    // Copy __set_PSP/__set_MSPLIM/__set_PSPLIM from cmsis_armclang.h
    __ASM volatile("MSR psp, %0" : : "r"((uint32_t)(&__INITIAL_SP)) :);
    __ASM volatile("MSR msplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));
    __ASM volatile("MSR psplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));

#if 0   // To reduce code size

    // Enable SRAM1/2 functions are only available in secure mode
    if (SCU_IS_CPU_NS(SCU_NS) == 0)
    {
        // Unlock protected registers
        do
        {
            SYS->REGLCTL = 0x59UL;
            SYS->REGLCTL = 0x16UL;
            SYS->REGLCTL = 0x88UL;
        } while (SYS->REGLCTL == 0UL);

        // Switch SRAM0 to normal power mode
        if (PMC->SYSRB0PC != 0)
        {
            PMC->SYSRB0PC = 0;

            while (PMC->SYSRB0PC & PMC_SYSRB0PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM0 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM0CKEN_Msk;

        // Switch SRAM1 to normal power mode
        if (PMC->SYSRB1PC != 0)
        {
            PMC->SYSRB1PC = 0;

            while (PMC->SYSRB1PC & PMC_SYSRB1PC_PCBUSY_Msk)
                ;
        }

        // Enable SRAM1 clock
        CLK->SRAMCTL |= CLK_SRAMCTL_SRAM1CKEN_Msk;
    }

#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    SCB_InvalidateICache();
    SCB_EnableICache();

#if (NVT_DCACHE_ON == 1)
    SCB_InvalidateDCache();
    SCB_EnableDCache();
#endif  // (NVT_DCACHE_ON == 1)

    __PROGRAM_START();      // Enter PreMain (C library entry point)
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif


/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
void HardFault_Handler(void)
{
    while (1) ;
}

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
    while (1) ;
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
#endif

/*** (C) COPYRIGHT 2023 Nuvoton Technology Corp. ***/